Merge pull request #2 from UrRhb/feat/v2-plugin-integration
Feat/v2 plugin integration
